MrQark/MPC574XG_MCAL4_0_RTM_1_0_5_Sample_Application_fix/toolchains/Startup_vle_os.c
    ASM_KEYWORD(" e_lis     r6,0xFC05 ");
    ASM_KEYWORD(" e_or2i    r6,0x0010 ");
    ASM_KEYWORD(" e_li      r7,0xC520 ");
    ASM_KEYWORD(" se_stw    r7,0x0(r6)");
    ASM_KEYWORD(" e_li      r7,0xD928 ");
    ASM_KEYWORD(" se_stw    r7,0x0(r6)"); /* # Disengage soft-lock */

    ASM_KEYWORD(" e_lis     r6,0xFC05 ");
    ASM_KEYWORD(" e_or2i    r6,0x0000 ");
    ASM_KEYWORD(" e_lis     r7,0xFF00 ");
    ASM_KEYWORD(" e_or2i    r7,0x0106 ");
    ASM_KEYWORD(" se_stw    r7,0x0(r6) "); /* # WEN = 0 */

    ASM_KEYWORD(" e_lis     r6,0xFC05 ");
    ASM_KEYWORD(" e_or2i    r6,0x4010 ");
    ASM_KEYWORD(" e_li      r7,0xC520 ");
    ASM_KEYWORD(" se_stw    r7,0x0(r6)");
    ASM_KEYWORD(" e_li      r7,0xD928 ");
    ASM_KEYWORD(" se_stw    r7,0x0(r6)"); /* # Disengage soft-lock */

    ASM_KEYWORD(" e_lis     r6,0xFC05 ");
    ASM_KEYWORD(" e_or2i    r6,0x4000 ");
    ASM_KEYWORD(" e_lis     r7,0xFF00 ");
    ASM_KEYWORD(" e_or2i    r7,0x010A ");
    ASM_KEYWORD(" se_stw    r7,0x0(r6) "); /* # WEN = 0 */
    
#ifndef MPC5746C   
    ASM_KEYWORD(" e_lis     r6,0xFC05 ");
    ASM_KEYWORD(" e_or2i    r6,0x8010 ");
    ASM_KEYWORD(" e_li      r7,0xC520 ");
    ASM_KEYWORD(" se_stw    r7,0x0(r6)");
    ASM_KEYWORD(" e_li      r7,0xD928 ");
    ASM_KEYWORD(" se_stw    r7,0x0(r6)"); /* # Disengage soft-lock */

    ASM_KEYWORD(" e_lis     r6,0xFC05 ");
    ASM_KEYWORD(" e_or2i    r6,0x8000 ");
    ASM_KEYWORD(" e_lis     r7,0xFF00 ");
    ASM_KEYWORD(" e_or2i    r7,0x010A ");
    ASM_KEYWORD(" se_stw    r7,0x0(r6) "); /* # WEN = 0 */
#endif
/******************************************************************/
/* Autosar Guidance 7 - The start-up code shall initialize MCU    */
/* specific features of internal memory like memory protection.   */
/*                                                                */
/******************************************************************/
   /* Configure SSCM module ERROR register to generate bus abort 
      on any access to a peripheral slot that is not used on the
      device(PAE bit). Configure SSCM to generate bus abort on 
      illegal accesses to off-platform peripherals. 
      REG_WRITE16(SSCM_ERROR, SSCM_ERROR_PAE | SSCM_ERROR_RAE);
    */
    ASM_KEYWORD(" e_lis     r7,0xFFFF ");
    ASM_KEYWORD(" se_li     r6,0x3 ");
    ASM_KEYWORD(" e_or2i    r7,0x8006 ");
    ASM_KEYWORD(" se_sth    r6,0x0(r7) ");
    
/******************************************************************/
/* Autosar Guidance 8 - If external memory is used, the memory    */
/* shall be initialized in the start-up code. The start-up code   */
/* shall be prepared to support different memory configurations   */
/* depending on code location. Different configuration options    */
/* shall be taken into account for code execution from            */
/* external/internal memory.                                      */
/* N/A - external memory is not used                              */
/******************************************************************/

/******************************************************************/
/* Autosar Guidance 9 - The settings of the different memories    */
/* shall be provided to the start-up code as configuration        */
/* parameters.                                                    */
/* N/A - all memories are already configured                      */
/******************************************************************/

/******************************************************************/
/* Autosar Guidance 10 - In the start-up code a default           */
/* initialization of the MCU clock system shall be performed      */
/* including global clock prescalers.                             */
/******************************************************************/

/******************************************************************/
/* Autosar Guidance 11 - The start-up code shall enable           */
/* protection mechanisms for special function registers(SFR’s),   */
/* if supported by the MCU.                                       */
/* N/A - will be handled by Autosar OS                            */
/******************************************************************/
/* Setup the AIPS bus bridge and its protection features. Avoid that any access  */
/* to a peripheral fails due to protection settings  For this purpose remove any */
/* protection feature that might have been defined by default settings.          */
/* To do so, we write b'0111 (0x7) into every protection field MPROT of the      */

/* AIPS_A_MPROT register, which will setup all 8 master ports accordingly.         */
/*  The meaning of these four bits is as follows:                                */
/*   0 - Master Buffer Writes: no (Write accesses are not bufferable)            */
/*   1 - Master Trusted for Reads                                                */
/*   1 - Master Trusted for Writes                                               */
/*   1 - Master Priviledge Level: accesses are not forced to user-mode           */
/* NOTE: we do only setup the masters M0-M7, M8-M15 are not modified at all.     */
   
    ASM_KEYWORD(" .equ AIPS_A_MPRA, 0xFC000000 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_MPRA@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_MPRA@l ");
    ASM_KEYWORD(" e_lis   r5, 0x77777777@ha ");
    ASM_KEYWORD(" e_or2i  r5, 0x77777777@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");
    ASM_KEYWORD(" e_li r5, 0 ");
    
/* Allow non-priviledged access to all peripherals (on and off-platform). This is */
/* achieved by modifying the PACR and OPACR registers in the AIPS.                */
/* To do so, we write b'0000 (0x0) into every peripheral access control reg.      */
/* The meaning of these four bits is as follows:                                  */
/*   0 - Buffer Writes: no                                                        */
/*   0 - Supervisor Protect: periph. doesn't require supervisor priviledge level  */
/*   0 - Write Protect: no (peripheral allows write accesses)                     */
/*   0 - Trusted Protect: no (accesses from an untrusted master allowed)          */

    ASM_KEYWORD(" .equ AIPS_A_PACRA, 0xFC000100 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_PACRA@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_PACRA@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");

    ASM_KEYWORD(" .equ AIPS_A_PACRB, 0xFC000104 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_PACRB@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_PACRB@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");
     
    ASM_KEYWORD(" .equ AIPS_A_PACRC, 0xFC000108 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_PACRC@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_PACRC@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) "); 
    
    ASM_KEYWORD(" .equ AIPS_A_PACRD, 0xFC00010C ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_PACRD@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_PACRD@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");
/*    
    ASM_KEYWORD(" .equ AIPS_A_PACRE, 0xFC000110 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_PACRE@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_PACRE@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");        
*/
    ASM_KEYWORD(" .equ AIPS_A_PACRF, 0xFC000114 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_PACRF@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_PACRF@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");  
    
    ASM_KEYWORD(" .equ AIPS_A_PACRG, 0xFC000118 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_PACRG@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_PACRG@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");  
    
    ASM_KEYWORD(" .equ AIPS_A_PACRH, 0xFC00011C ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_PACRH@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_PACRH@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");  
    
    ASM_KEYWORD(" .equ AIPS_A_OPACRA, 0xFC000140 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRA@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRA@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");  
  
    ASM_KEYWORD(" .equ AIPS_A_OPACRB, 0xFC000144 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRB@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRB@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");  
    
    ASM_KEYWORD(" .equ AIPS_A_OPACRC, 0xFC000148 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRC@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRC@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) "); 
    
    ASM_KEYWORD(" .equ AIPS_A_OPACRD, 0xFC00014C ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRD@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRD@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");   
    
    ASM_KEYWORD(" .equ AIPS_A_OPACRE, 0xFC000150 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRE@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRE@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");  
    
    ASM_KEYWORD(" .equ AIPS_A_OPACRF, 0xFC000154 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRF@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRF@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");   
    
    ASM_KEYWORD(" .equ AIPS_A_OPACRG, 0xFC000158 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRG@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRG@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");    
 
    ASM_KEYWORD(" .equ AIPS_A_OPACRH, 0xFC00015C ");
    ASM_KEYWORD(" e_lis   r4, AIPS_A_OPACRH@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_A_OPACRH@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");    
    
