MrQark/MPC574XG_MCAL4_0_RTM_1_0_5_Sample_Application_fix/toolchains/Startup_vle_os.c
/************/
/* .ramcode */
/************/
     ASM_KEYWORD(" e_lis   r5, RC_RAMCODE_SIZE@h");      /* Number of words */
     ASM_KEYWORD(" e_or2i    r5, RC_RAMCODE_SIZE@l");      /* Number of words */
     ASM_KEYWORD(" or.   r5, r5, r5");                     /* Number of words */
     ASM_KEYWORD(" e_beq   data_copy4");
     ASM_KEYWORD(" se_mtctr r5");                       /* configure control register for use with e_bdnz */

/* source address of the section */
     ASM_KEYWORD(" e_lis   r8, RC_RAMCODE_SRC@h");
     ASM_KEYWORD(" e_or2i    r8, RC_RAMCODE_SRC@l");
     ASM_KEYWORD(" e_subi  r8,r8,4");                   /* decrement by 4 to prepare for e_stwu in loop */

/* Destination address of the section */
     ASM_KEYWORD(" e_lis   r9, RC_RAMCODE_DEST@h");
     ASM_KEYWORD(" e_or2i    r9, RC_RAMCODE_DEST@l");
     ASM_KEYWORD(" e_subi  r9,r9,4");                   /* decrement by 4 to prepare for e_stwu in loop */

/* Repeat */
     ASM_KEYWORD("data_copy_loop4:");
     ASM_KEYWORD(" e_lwzu  r10,4(r8)");
     ASM_KEYWORD(" e_stwu  r10,4(r9)");
     ASM_KEYWORD(" e_bdnz  data_copy_loop4");
     ASM_KEYWORD("data_copy4:");

/*********************************/
/* Set the small ro data pointer */
/*********************************/
     ASM_KEYWORD(" e_lis   r2, SDATA_RO_START@h");
     ASM_KEYWORD(" e_or2i    r2, SDATA_RO_START@l");

/*********************************/
/* Set the small rw data pointer */
/*********************************/
     ASM_KEYWORD(" e_lis   r13, SDATA_RW_START@h");
     ASM_KEYWORD(" e_or2i    r13, SDATA_RW_START@l");

     
/******************************************************************/
/* Autosar Guidance 6 - If the MCU supports cache memory for data */
/* and/or code, it shall be initialized and enabled in the        */
/* start-up code.                                                 */
/*                                                                */
/******************************************************************/
#ifdef MPC5748G  
/* no chaches available on CORE2 - jump over CACHES and SMPU settings */
ASM_KEYWORD("mfspr       r4, PIR");
ASM_KEYWORD("e_cmphl16i  r4, 0x00000002@l");
ASM_KEYWORD("se_bc       0b01, 2, CACHE_END_CFG ");
#else
/* no chaches available on CORE2 - jump over CACHES and SMPU settings */
ASM_KEYWORD("mfspr       r4, PIR");
ASM_KEYWORD("e_cmphl16i  r4, 0x00000001@l");
ASM_KEYWORD("se_bc       0b01, 2, CACHE_END_CFG ");
#endif

/* invalidate and enable the data and instruction caches          */
/* data cache */
#ifdef D_CACHE_ENABLE
    ASM_KEYWORD("DCACHE_CFG: ");
    ASM_KEYWORD(" e_li r5, 0x2 ");
    ASM_KEYWORD(" mtspr l1csr0,r5 ");
    
    ASM_KEYWORD(" e_li r7, 0x4 ");
    ASM_KEYWORD(" e_li r8, 0x2 ");
    ASM_KEYWORD(" e_lis   r11, 0xFFFF ");
    ASM_KEYWORD(" e_or2i  r11, 0xFFFB ");
    
    ASM_KEYWORD("DCACHE_INV: ");
    ASM_KEYWORD(" mfspr r9, l1csr0 ");
    ASM_KEYWORD(" and.  r10, r7, r9 ");
    ASM_KEYWORD(" e_beq   DCACHE_NO_ABORT ");
    ASM_KEYWORD(" and.  r10, r11, r9 ");
    ASM_KEYWORD(" mtspr l1csr0, r10 ");
    ASM_KEYWORD(" e_b  DCACHE_CFG ");
    
    ASM_KEYWORD("DCACHE_NO_ABORT: ");
    ASM_KEYWORD(" and.  r10, r8, r9 ");
    ASM_KEYWORD(" e_bne DCACHE_INV ");
    
    ASM_KEYWORD(" mfspr r5, l1csr0 ");
    ASM_KEYWORD(" e_ori   r5, r5, 0x0001 ");
    ASM_KEYWORD(" se_isync ");
    ASM_KEYWORD(" msync ");
    ASM_KEYWORD(" mtspr l1csr0, r5 ");
#endif   
 
/* inst cache */
#ifdef I_CACHE_ENABLE
    
    ASM_KEYWORD("ICACHE_CFG:");
    ASM_KEYWORD(" e_li r5, 0x2 ");
    ASM_KEYWORD(" mtspr l1csr1,r5 ");
    
    ASM_KEYWORD(" e_li r7, 0x4 ");
    ASM_KEYWORD(" e_li r8, 0x2 ");
    ASM_KEYWORD(" e_lis   r11, 0xFFFF ");
    ASM_KEYWORD(" e_or2i  r11, 0xFFFB ");
    
    ASM_KEYWORD("ICACHE_INV:");
    ASM_KEYWORD(" mfspr r9, l1csr1 ");
    ASM_KEYWORD(" and.  r10, r7, r9 ");
    ASM_KEYWORD(" e_beq   ICACHE_NO_ABORT ");
    ASM_KEYWORD(" and.  r10, r11, r9 ");
    ASM_KEYWORD(" mtspr l1csr1, r10 ");
    ASM_KEYWORD(" e_b  ICACHE_CFG");
    
    ASM_KEYWORD("ICACHE_NO_ABORT:");
    ASM_KEYWORD(" and.  r10, r8, r9 ");
    ASM_KEYWORD(" e_bne ICACHE_INV ");
    
    ASM_KEYWORD(" mfspr r5, l1csr1 ");
    ASM_KEYWORD(" e_ori   r5, r5, 0x0001 ");
    ASM_KEYWORD(" se_isync ");
    ASM_KEYWORD(" msync ");
    ASM_KEYWORD(" mtspr l1csr1, r5 ");
   
#endif    
    ASM_KEYWORD("CACHE_END_CFG:");        
/******************************************************************/
/* Freescale Guidance 4 - SMPU                                    */
/******************************************************************/
    /* Configure Flash region */
    SMPU_0.RGD[0].WORD0.R = 0x00400000; /* Start Address */
    /* change to 0x0040_0000 (UTEST, BAF, DataFlash) */
    SMPU_0.RGD[0].WORD1.R = 0x02000000; /* End Address */
    SMPU_0.RGD[0].WORD2.FMT0.R = 0xFFFFFFFF; /* Permissions - set read / write for all masters */
    SMPU_0.RGD[0].WORD3.B.CI = 0;
    SMPU_0.RGD[0].WORD5.B.VLD = 1;/* Valid bit */
    
    /* Configure Peripheral Space, cache-inhibit = TRUE */
    SMPU_0.RGD[1].WORD0.R = 0xF0000000;
    SMPU_0.RGD[1].WORD1.R = 0xFFFFFFFF;
    SMPU_0.RGD[1].WORD2.FMT0.R = 0xFFFFFFFF;
    SMPU_0.RGD[1].WORD3.B.CI = 1;
    SMPU_0.RGD[1].WORD5.B.VLD = 1;
    
    /* Configure CACHABLE_RAM regions */
    SMPU_0.RGD[2].WORD0.R = (uint32) (&__RAM_CACHEABLE_START);    
    SMPU_0.RGD[2].WORD1.R = (uint32) (&__RAM_CACHEABLE_END);
    SMPU_0.RGD[2].WORD2.FMT0.R = 0xFFFFFFFF;
    SMPU_0.RGD[2].WORD3.B.CI = 0;
    SMPU_0.RGD[2].WORD5.B.VLD = 1;
   
    /* Configure NO_CACHABLE RAM regions */
    SMPU_0.RGD[3].WORD0.R = (uint32)(&__RAM_NO_CACHEABLE_START);    
    SMPU_0.RGD[3].WORD1.R = (uint32)(&__RAM_NO_CACHEABLE_END);
    SMPU_0.RGD[3].WORD2.FMT0.R = 0xFFFFFFFF;
#ifdef D_CACHE_ENABLE    
    SMPU_0.RGD[3].WORD3.B.CI = 1;
#else
    SMPU_0.RGD[3].WORD3.B.CI = 0;
#endif    
    SMPU_0.RGD[3].WORD5.B.VLD = 1;
    
    /* Enable the module */
    SMPU_0.CES0.B.GVLD = 1;
    
#ifndef MPC5746C
    /* Configure Flash region */
    SMPU_1.RGD[0].WORD0.R = 0x00400000; /* Start Address */
    /* change to 0x0040_0000 (UTEST, BAF, DataFlash) */
    SMPU_1.RGD[0].WORD1.R = 0x02000000; /* End Address */
    SMPU_1.RGD[0].WORD2.FMT0.R = 0xFFFFFFFF; /* Permissions - set read / write for all masters */
    SMPU_1.RGD[0].WORD3.B.CI = 0;
    SMPU_1.RGD[0].WORD5.B.VLD = 1;  /* Valid bit */
    
