MrQark/MPC574XG_MCAL4_0_RTM_1_0_5_Sample_Application_fix/toolchains/Startup_vle_os.c
    /* Configure Peripheral Space, cache-inhibit = TRUE */
    SMPU_1.RGD[1].WORD0.R = 0xF0000000;
    SMPU_1.RGD[1].WORD1.R = 0xFFFFFFFF;
    SMPU_1.RGD[1].WORD2.FMT0.R = 0xFFFFFFFF;
    SMPU_1.RGD[1].WORD3.B.CI = 1;
    SMPU_1.RGD[1].WORD5.B.VLD = 1; 
    
    /* Configure CACHABLE_RAM regions */
    SMPU_1.RGD[2].WORD0.R = (uint32)(&__RAM_CACHEABLE_START);    
    SMPU_1.RGD[2].WORD1.R = (uint32)(&__RAM_CACHEABLE_END);
    SMPU_1.RGD[2].WORD2.FMT0.R = 0xFFFFFFFF;
    SMPU_1.RGD[2].WORD3.B.CI = 0;
    SMPU_1.RGD[2].WORD5.B.VLD = 1;
   
    /* Configure NO_CACHABLE RAM regions */
    SMPU_1.RGD[3].WORD0.R = (uint32)(&__RAM_NO_CACHEABLE_START);    
    SMPU_1.RGD[3].WORD1.R = (uint32)(&__RAM_NO_CACHEABLE_END);
    SMPU_1.RGD[3].WORD2.FMT0.R = 0xFFFFFFFF;
#ifdef D_CACHE_ENABLE    
    SMPU_1.RGD[3].WORD3.B.CI = 1;
#else
    SMPU_1.RGD[3].WORD3.B.CI = 0;
#endif 
    SMPU_1.RGD[3].WORD5.B.VLD = 1;
    
    /* Enable the module */
    SMPU_1.CES0.B.GVLD = 1;
#endif
/******************************************************************/
/* Freescale Guidance 4 - Set up INTC                             */
/******************************************************************/
/* The interrupt controller is set up by Autosar OS */

/******************************************************************/
/* Call Main Routine                                              */
/******************************************************************/
    /* Prepare a terminating stack record. */
    ASM_KEYWORD (" e_li r0, -1");
    ASM_KEYWORD (" e_stwu r1, -8(r1)"); /* Decrement stack by 8 bytes, (write word) */
    ASM_KEYWORD (" e_stw  r0, 4(r1)");  /* Make an illegal return address of 0xFFFFFFFF */
    ASM_KEYWORD (" e_stw  r0, 0(r1)");  /* Make an illegal back chain address of 0xFFFFFFFF */

/******************************************************************/
/* Init runtime check data space                                  */
/******************************************************************/
#ifdef ENABLE_RCHECK
    /* initialization for the runtime checks memory space */
    init_runtime_check();
#endif /* ENABLE_RCHECK */
    
    main();
    
    /* Define a symbol to Turn OFF (stop the tracing and save the data) the LTB PowerTracer */    
    ASM_KEYWORD(" .globl MCAL_LTB_TRACE_OFF");
    ASM_KEYWORD("MCAL_LTB_TRACE_OFF:");
    ASM_KEYWORD(" e_nop");
    
#ifdef CCOV_ENABLE
    /* code coverage is requested */
    ccov_main();
#endif
  
    ASM_KEYWORD ("se_illegal"); /* SW breakpoint to stop debugging */
     
    while (1)
    {
    }
   
}

